# Brewfile
#
# Install with:
# brew bundle install --file Brewfile

## Taps
tap "1password/tap"
tap "railwaycat/emacsmacport"

## Formulas
brew "age"                  # Simple, modern, secure file encryption
brew "age-plugin-yubikey"   # Plugin for encrypting files with age and PIV tokens such as YubiKeys
brew "aria2"                # Download with resuming and segmented downloading
brew "atool"                # Archival front-end
brew "caddy"                # Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "comby"                # Tool for changing code across many languages
brew "coreutils"            # GNU File, Shell, and Text utilities
brew "difftastic"           # Diff that understands syntax
brew "direnv"               # Load/unload environment variables based on $PWD
brew "dnscontrol"           # Synchronize your DNS to multiple providers from a simple DSL
brew "dnscrypt-proxy"       # Secure communications between a client and a DNS resolver
brew "doggo"                # Command-line DNS client
brew "enchant"              # Spellchecker wrapping library
brew "eza"                  # Modern, maintained replacement for ls
brew "fd"                   # Simple, fast and user-friendly alternative to find
brew "figlet"               # Banner-like program prints strings as ASCII art
brew "fortune"              # Infamous electronic fortune-cookie generator
brew "fx"                   # Terminal JSON viewer
brew "fzf"                  # Command-line fuzzy finder written in Go
brew "gh"                   # GitHub command-line tool
brew "git"                  # Distributed revision control system
brew "git-delta"            # Syntax-highlighting pager for git and diff output
brew "go-task"              # Task is a task runner/build tool that aims to be simpler and easier to use
brew "goreleaser"           # Deliver Go binaries as fast and easily as possible
brew "gping"                # Ping, but with a graph
brew "gum"                  # Tool for glamorous shell scripts
brew "hadolint"             # Smarter Dockerfile linter to validate best practices
brew "hugo"                 # Configurable static site generator
brew "hunspell"             # Spell checker and morphological analyzer
brew "jj"                   # Git-compatible distributed version control system
brew "jq"                   # Lightweight and flexible command-line JSON processor
brew "jsonnet"              # Domain specific configuration language for defining JSON data
brew "jsonnet-bundler"      # Package manager for Jsonnet
brew "k9s"                  # Kubernetes CLI To Manage Your Clusters In Style!
brew "kubectx"              # Tool that can switch between kubectl contexts easily and create aliases
brew "kubernetes-cli"       # Kubernetes command-line interface
brew "leveldb"              # Key-value storage library with ordered mapping
brew "lftp"                 # Sophisticated file transfer program
brew "links"                # Lynx-like WWW browser that supports tables, menus, etc.
brew "magic-wormhole"       # Securely transfers data between computers
brew "mkcert"               # Simple tool to make locally trusted development certificates
brew "moreutils"            # Collection of tools that nobody wrote when UNIX was young
brew "mosh"                 # Remote terminal application
brew "mtr"                  # 'traceroute' and 'ping' in a single tool
brew "ncdu"                 # NCurses Disk Usage
brew "neofetch"             # Fast, highly customisable system info script
brew "nmap"                 # Port scanning utility for large networks
brew "nushell"              # Modern shell for the GitHub era
brew "pkg-config"           # Manage compile and link flags for libraries
brew "pstree"               # Show ps output as a tree
brew "pv"                   # Monitor data's progress through a pipe
brew "python3"              # Interpreted, interactive, object-oriented programming language
brew "riff"                 # Diff filter highlighting which line parts have changed
brew "ripgrep"              # Search tool like grep and The Silver Searcher
brew "sd"                   # Intuitive find & replace CLI
brew "shellcheck"           # Static analysis and lint tool, for (ba)sh scripts
brew "sqlite"               # Command-line interface for SQLite
brew "stern"                # Tail multiple Kubernetes pods & their containers
brew "tig"                  # Text interface for Git repositories
brew "tmux"                 # Terminal multiplexer
brew "trippy"               # Network diagnostic tool, inspired by mtr
brew "vivid"                # Generator for LS_COLORS with support for multiple color themes
brew "wget"                 # Internet file retriever
brew "yaml-language-server" # Language Server for Yaml Files
brew "ykman"                # Tool for managing your YubiKey configuration
brew "zoxide"               # Shell extension to navigate your filesystem faster
brew "zsh-autosuggestions"  # Fish-like fast/unobtrusive autosuggestions for zsh

## Casks
cask "1password-cli"
cask "emacs-mac"

## Fonts
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-noto-serif"
cask "font-overpass"
cask "font-rubik"
cask "font-victor-mono"
