# Brewfile
#
# Install with:
# brew bundle install --file Brewfile

## Taps
tap "homebrew/cask-fonts"
tap "1password/tap"
tap "hashicorp/tap"
tap "railwaycat/emacsmacport"

## Formulas
# Simple, modern, secure file encryption
brew "age"

# Plugin for encrypting files with age and PIV tokens such as YubiKeys
brew "age-plugin-yubikey"

# Command-line interface for SQLite
brew "sqlite"

# Download with resuming and segmented downloading
brew "aria2"

# Archival front-end
brew "atool"

# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"

# Tool for service discovery, monitoring and configuration
brew "consul"

# GNU File, Shell, and Text utilities
brew "coreutils"

# Diff that understands syntax
brew "difftastic"

# Load/unload environment variables based on $PWD
brew "direnv"

# Secure communications between a client and a DNS resolver
brew "dnscrypt-proxy"

# Command-line DNS client
brew "dog"

# Spellchecker wrapping library
brew "enchant"

# Modern, maintained replacement for ls
brew "eza"

# Simple, fast and user-friendly alternative to find
brew "fd"

# Banner-like program prints strings as ASCII art
brew "figlet"

# Infamous electronic fortune-cookie generator
brew "fortune"

# Platform built on V8 to build network applications
brew "node"

# Terminal JSON viewer
brew "fx"

# Command-line fuzzy finder written in Go
brew "fzf"

# WebDriver <-> Marionette proxy
brew "geckodriver"

# GitHub command-line tool
brew "gh"

# Distributed revision control system
brew "git"

# Syntax-highlighting pager for git and diff output
brew "git-delta"

# Deliver Go binaries as fast and easily as possible
brew "goreleaser"

# Ping, but with a graph
brew "gping"

# Tool for glamorous shell scripts
brew "gum"

# Smarter Dockerfile linter to validate best practices
brew "hadolint"

# Configurable static site generator
brew "hugo"

# Spell checker and morphological analyzer
brew "hunspell"

# Full featured terminal-based screen editor
brew "joe"

# Lightweight and flexible command-line JSON processor
brew "jq"

# Domain specific configuration language for defining JSON data
brew "jsonnet"

# Package manager for Jsonnet
brew "jsonnet-bundler"

# Key-value storage library with ordered mapping
brew "leveldb"

# Sophisticated file transfer program
brew "lftp"

# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"

# Simple tool to make locally trusted development certificates
brew "mkcert"

# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"

# Remote terminal application
brew "mosh"

# 'traceroute' and 'ping' in a single tool
brew "mtr"

# Text-based UI library
brew "ncurses"

# NCurses Disk Usage
brew "ncdu"

# Fast, highly customisable system info script
brew "neofetch"

# Port scanning utility for large networks
brew "nmap"

# Distributed, Highly Available, Datacenter-Aware Scheduler
brew "nomad"

# Manage compile and link flags for libraries
brew "pkg-config"

# Service monitoring system and time series database
brew "prometheus"

# Monitor data's progress through a pipe
brew "pv"

# Interpreted, interactive, object-oriented programming language
brew "python@3.9"

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"

# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"

# Tool to build, change, and version infrastructure
brew "terraform"

# Text interface for Git repositories
brew "tig"

# Terminal multiplexer
brew "tmux"

# Secures, stores, and tightly controls access to secrets
brew "vault"

# HTTP load testing tool and library
brew "vegeta"

# Generator for LS_COLORS with support for multiple color themes
brew "vivid"

# Internet file retriever
brew "wget"

# Tool for managing your YubiKey configuration
brew "ykman"

# Terraform Language Server
brew "hashicorp/tap/terraform-ls"

## Casks
cask "1password-cli"
cask "emacs-mac"

## Fonts

cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

cask "font-monaspace"
cask "font-victor-mono"

cask "font-overpass"
cask "font-rubik"
cask "font-noto-serif"
